#+TITLE: Python网络编程
#+DATE: 2023-10-03 17:39:21
#+DISPLAY: t
#+STARTUP: indent
#+OPTIONS: toc:10
#+AUTHOR: inmove
#+SUBTITLE: 套接字C-S 高并发: Epoll,内置selectors,asyncio,协程
#+KEYWORDS: Epoll
#+CATEGORIES: NetworkProgramming

** 使用setsockopt的例子
#+begin_src python :results output
  import socket
  import struct

  sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

  sock.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)
  sock.setsockopt(socket.IPPROTO_TCP, socket.TCP_NODELAY, 1)
  sock.setsockopt(socket.SOL_SOCKET, socket.SO_KEEPALIVE, 1)

  sock.setsockopt(socket.SOL_SOCKET, socket.SO_RCVBUF, 8192)
  sock.setsockopt(socket.SOL_SOCKET, socket.SO_SNDBUF, 8192)
  linger_struct = struct.pack('ii', 1, 0)  # 使套接字关闭时立即返回，丢弃所有未发送的数据
  sock.setsockopt(socket.SOL_SOCKET, socket.SO_LINGER, linger_struct)

  print(sock.getsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR))
  print(sock.getsockopt(socket.SOL_SOCKET, socket.SO_RCVBUF))
  print(sock.getsockopt(socket.SOL_SOCKET, socket.SO_SNDBUF))
#+end_src

#+RESULTS:
: 1
: 16384
: 16384

